#1. 문자열 리스트를 입력 받아서 내림차순 결과 가장 낮은 문자열과 가장 높은 문자열을 출력하는 함수를 구현하세요.
#1-1단어 하나씩 6번 입력받는 방법
def 정렬(A):
    A.sort(reverse=True)
    print(f'정렬 결과 : {A}\n가장 높은 문자열 : {A[0]}, 가장 낮은 문자열 : {A[-1]}')

msg=[]
[msg.append(input()) for i in range(6)]
정렬(msg)

#1-2 한번에 여러 단어 입력 받는 방법
def 정렬(A):
    A=A.split(',')
    B=sorted(A,reverse=True)
    print(f'정렬 결과 : {B}\n가장 높은 문자열 : {B[0]}, 가장 낮은 문자열 : {B[-1]}')

#정렬(input('문자열 입력 : '))
문자='Good,child,zero,Zoo,Flower,Bape,Supreme'
정렬(문자)

#------------------------------------------------------------------------------------------------

#2. 문자열을 입력하면 UTF-8로 인코딩된 값을 아래와 같이 출력된 함수를 구현해 주세요.
def 인코딩(data):
    A=[hex(ord(i)) for i in data]
    B=[bin(ord(i)) for i in data]
    print(f'\"{data}"의 인코딩 : ',*A,sep='')
    print(f'\"{data}"의 인코딩 : ',*B,sep='')

인코딩(input('데이터 입력 : '))

#------------------------------------------------------------------------------------------------

#3. 숫자와 콤마로만 이루어진 문자열 data가 주어진다. 이때, data에 포함되어있는 자연 수의 합과 가장 작은 수, 가장 큰 수를 출력하는 함수를 구현하세요.
def 계산(A):
    B=[]
    [B.append(int(i)) for i in A if i.isdigit()]
    print(f'\"{A}"의 합 : ',sum(B),', 가장 큰 수 : ',max(B),', 가장 작은 수 : ',min(B))

#계산(input('숫자와 콤마로만 이루어진 문자열 입력: '))
계산('123,42,98,18')
계산('1,234')

#3-2 다른 방식
def 계산(nums):
    A=list(filter(str.isdigit,nums)); B=[]
    for i in A: B.append(int(i))
    print(f'\"{nums}"의 합 : {sum(B)}, 가장 큰 수 : {max(B)}, 가장 작은 수 : {min(B)}')

#계산(input('숫자와 콤마로만 이루어진 문자열 입력 :'))
숫자='123,42,98,18'
계산(숫자)

#------------------------------------------------------------------------------------------------

#4. 2, 4, 8 게임은 숫자의 끝 자리가 2, 4, 8로 끝나는 숫자의 경우 다른 문자로 출력하는 게임으로 아래 조건을 만족하도록 구현하자.
num=int(input('숫자 입력 : '))
for i in range(1,num+1):
    if i%10 in [2,4,8]: print('#',end='')
    elif i%20==0: print(i)
    else: print(i,end='')

#4-2 함수 형태
def 게임(num):
    num=int(num)
    for i in range(1,num+1):
        if i%10 in [2,4,8]: print('#',end='')
        elif i%20==0: print(i)
        else: print(i,end='')

#게임(input('게임 정수 입력 : '))
숫자=100
게임(숫자)

#------------------------------------------------------------------------------------------------

#5. 월(Month)을 입력 받아 해당 월(Month)의 영어와 계절을 출력하는 코드를 작성하세요.
def 출력(월):
    월=int(월)
    달=['Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec']
    if 월 in [3,4,5]: print(달[월-1],'Spring')
    elif 월 in [6,7,8]: print(달[월-1],'Summer')
    elif 월 in [9,10,11]: print(달[월-1],'Fall')
    elif 월 in [12,1,2]: print(달[월-1],'Winter')
    else: print('존재하지 않는 월입니다.')

#출력(input('좋아하는 월 입력 : '))
월='7'
출력(월)

#------------------------------------------------------------------------------------------------

#6. 숫자와 화폐단위를 입력 받아 세자리 마다 쉼표(,) 찍어서 출력하는 기능을 구현하세요.
def 출력(A):
    A=A.split(',')
    print(format(int(A[0]), ','),end='')
    print(A[1])

data='1234567,$' #input('숫자 입력 :(예:1234567,$) ')
출력(data)

#6-2 다른 방식
def 출력(data):
    a,b=data.split(', ')
    print(format(int(a),','),b,sep='')

data='907000, $'
출력(data)

#------------------------------------------------------------------------------------------------

#7. 입력받은 정수에 대한 약수를 출력하는 함수를 만들어 주세요.
def 약수(A):
    A=int(A); B=[]
    for i in range(1,A+1):
        if A%i==0: B.append(i)
    print(f'{A}의 약수: ',end='')
    print(*B,sep=', ')

num=input('약수 구하고 싶은 수 : ')
약수(num)

#------------------------------------------------------------------------------------------------

#8. 입력 받은 메시지 중에서 중복 없이 숫자만 출력하는 함수를 만들어 주세요.
def 출력(text):
    A=list(filter(str.isdigit,text))
    B=list(dict.fromkeys(A))
    print(*B,sep=', ')

출력('happy 2023')
출력('홍길동 010-3113-0782')

#------------------------------------------------------------------------------------------------

#9. 생일을 입력 받은 후 한국 나이, 외국 나이를 알려주는 함수를 생성해 주세요. 
def 나이(birth):
    A=list(map(int,filter(str.isdigit,birth)))
    B=(A[0]*1000+A[1]*100+A[2]*10+A[3])
    print(f'당신의 한국 나이는 {2022-B+1}세 입니다.')
    if A[4]*10+A[5] <= 12:
        if A[6]*10+A[7] < 26:
            print(f'당신의 외국 나이는 {2022-B}세 입니다.')
        else: print(f'당신의 외국 나이는 {2022-B-1}세 입니다.')
    else: print(f'당신의 외국 나이는 {2022-B-1}세 입니다.')

birth='1996.12.31'
나이(birth)

#------------------------------------------------------------------------------------------------

#10. 팩토리얼(Factorial)을 while반복문으로 구현해 주세요.
#팩토리얼 수를 입력 받아서 팩토리얼 결과를 아래와 같이 출력하세요.
i=int(input('팩토리얼 수 입력: '))
A=1; B=[]
if i==0: print('0! => 0')
else:
    while i>0:
        B.append(i)
        A=A*i
        i=i-1
    print(f'{B[0]}! => ',end='')
    print(*B,sep=' * ',end=' = ')
    print(A)

#------------------------------------------------------------------------------------------------

#11. 입력받은 숫자 범위 안에서 소수(Prime Number)를 찾아서 반환하는 함수를 생성하세요.
def prm(num):
    B=[]
    for i in range(1,num+1):
        A=[]
        for j in range(1,i+1):
            if i%j==0: A.append(i)
        if len(A)==2: B.append(i)
    print(f'1 ~ {num} 범위에서 소수: ',end='')
    print(*B,sep=', ')    

prm(30)
#prm(int(input('범위 숫자 입력 : ')))

#------------------------------------------------------------------------------------------------

#12. 아래 데이터를 저장합니다. 그리고 과목별 최고점수, 최저점수 출력하세요.
국어=[90,82,77,94,78]
수학=[89,71,100,82,99]
윤리=[98,80,92,93,91]
국사=[99,91,90,71,83]
과목=[국어,수학,윤리,국사]
과목2=['국어','수학','윤리','국사']
for i in range(0,len(과목)):
    print(f'[{과목2[i]}] 최고 점수 : {max(과목[i])}, 최저 점수 : {min(과목[i])}')

#------------------------------------------------------------------------------------------------

#13. 구구단 n단부터 m단까지를 반복문 1개로 구현하는 함수를 생성하세요.
def 구구단(n,m):
    a=n; b=1; switch=True
    while b != 10:
        if switch:
            print(f'--[{a}단]--',end='\t')
            a=a+1
            if a==m+1: switch=False; a=n; print()
        if not switch:
            print(f"{a}*{b}= {a*b}",end='\t\t')
            a=a+1
            if a==m+1: a=n; b=b+1; print()

구구단(2,4)

#------------------------------------------------------------------------------------------------

#14. 입력받은 숫자에서 천자리, 백자리, 십자리, 일자리를 출력하세요.
def 출력(num):
    print('숫자 : ',num)
    A=list(num)
    B=['만','천','백','십','일']
    for i in range(0,len(A)):
        print(f'{B[i]}의 자리: ',A[i])

출력('12345')

#------------------------------------------------------------------------------------------------

#15. 정수, 실수, 논리, 문자열 등 데이터 입력 시 모두 덧셈한 결과 출력하는 함수를  생성하세요.
def addData(*data):
    if len(data)>0:
        if isinstance(data[0],str): total=''
        else: total=0
    else: total=None
    for i in data:
        total = total + i
    print(total)
addData()
addData(True,True,False,False,True)
addData('A','BC','Good')
addData(2,9,3,5,8,7)
addData(13,-13)

#------------------------------------------------------------------------------------------------

#16. 아래 출력결과가 나오도록 코드를 작성하세요.
n=1
while n<=15:
    print(('*'*n).center(15))
    n=n+2
print(('*'*4).center(15))
print(('*'*4).center(15))
print(('Merry Chirstmas').center(15))
print(('2023').center(15))

#------------------------------------------------------------------------------------------------

#17. 문자열 ‘Merry Christmas HaPPy New YEaR’에서 대문자는 소문자로, 소문자는 대문자로 변환하여 출력하는 코드를 구현하세요.
text='Merry Christmas HaPPy New YEaR'
A=[i.swapcase() for i in text]
print(text,'\n=> ',*A,sep='')

#17-2 swapcase 안쓰고
text='Merry Christmas HaPPy New YEaR'
A=[i.lower() if i.isupper() else i.upper() for i in text]
print(text,'\n=> ',*A,sep='')

#------------------------------------------------------------------------------------------------

#18. 6가지 연산 결과를 한꺼번에 반환하는 함수를 생성 후 호출하여 결과를 아래와 같이 출력해 주세요.
def 연산(num):
    A=list(map(int,filter(str.isdigit,num)))
    print(f'덧셈 결과: {A[0]+A[1]}')
    print(f'뺄셈 결과: {A[0]-A[1]}')
    print(f'곱셈 결과: {A[0]*A[1]}')
    print(f'나누기 결과: {A[0]/A[1]}')
    print(f'몫 결과: {A[0]//A[1]}')
    print(f'나머지 결과: {A[0]%A[1]}')
연산(input('숫자 2개 입력 (3, 4) : '))

#------------------------------------------------------------------------------------------------

#19. 다양한 사람들로부터 개인정보를 입력받는 함수를 구현하세요.
def data(**info):
    for key,value in info.items():
        print(key,'=>',value)
data(age=12, id='mm1004',name='마징가', job='히어로', phone='01031130782',loc='대구')

#------------------------------------------------------------------------------------------------

#20. [나의 계산기] 프로그램을 구현하세요.
while True:
    print('-'*30,('<나의 계산기>').center(24),'-'*30,sep='\n')
    print('1.입  력   2.덧  셈   3.뺄  셈')
    print('4.곱  셈   2.나눗셈   3.종  료')
    print('-'*30)
    입력=int(input('메뉴 선택(1~6): '))
    print('메뉴 선택(1~6):',입력)
    if 입력==1:
        a=input('숫자 2개 입력 :(예: 1, 7) ')
        print(f'숫자 2개 입력 :(예: 1, 7) {a}')
        A=[]
        for i in a:
            if i.isdigit():
                A.append(int(i))
    elif 입력==2:
        print(f'{A[0]}+{A[1]}={A[0]+A[1]}')    
    elif 입력==3:
        print(A[0]-A[1])
    elif 입력==4:
        print(A[0]*A[1])
    elif 입력==5:
        print(A[0]/A[1])
    elif 입력==6:
        print('나의 계산기 프로그램 종료')
        break

#------------------------------------------------------------------------------------------------

#코딩테스트문제1
i=int(input('출력 원하는 단 입력: '))
A=[f'{i}*{j}={i*j}'for j in range(1,10) ]
print(*A,sep='\t')

#------------------------------------------------------------------------------------------------

#코딩테스트3
배트맨={90:'국어',89:'수학',98:'윤리',99:'국사'}
마징가={82:'국어',73:'수학',71:'윤리',91:'국사'}
피오나={78:'국어',99:'수학',91:'윤리',83:'국사'}
이름=[배트맨,마징가,피오나]
이름2=['배트맨','마징가','피오나']
for i in range(0,len(이름)):
    print('[',이름2[i],'] ',end='')
    print('최고 점수:',max(이름[i].keys()),이름[i].get(max(이름[i].keys())), '  최저 점수:',min(이름[i].keys()),이름[i].get(min(이름[i].keys())))

#------------------------------------------------------------------------------------------------

#코딩테스트4
id='000101-4234567' #input('주민번호 입력(000000-0000000): ')
A=[]
if int(id[7])==1 or int(id[7])==2:
    A.append(19)
else:
    A.append(20)
for i in id:
    if i.isdigit():
        A.append(int(i))
#나이
B=A[0]*100+A[1]*10+A[2]
print(f'{2022-B+1}세',end=', ')
#성별
if A[7]==1 or A[7]==3:print('남자',end=', ')
else: print('여자',end=', ')
#생년월일
print(f'{B}년{A[3]*10+A[4]}월{A[5]*10+A[6]}일',end=' ')
#띠
띠=['원숭이띠','닭띠','개띠','돼지띠','쥐띠','소띠','호랑이띠','토끼띠','용띠','뱀띠','말띠','양띠']
if B%12 ==0: print(띠[0],end=' ')
if B%12 ==1: print(띠[1],end=' ')
if B%12 ==2: print(띠[2],end=' ')
if B%12 ==3: print(띠[3],end=' ')
if B%12 ==4: print(띠[4],end=' ')
if B%12 ==5: print(띠[5],end=' ')
if B%12 ==6: print(띠[6],end=' ')
if B%12 ==7: print(띠[7],end=' ')
if B%12 ==8: print(띠[8],end=' ')
if B%12 ==9: print(띠[9],end=' ')
if B%12 ==10: print(띠[10],end=' ')
if B%12 ==11: print(띠[11],end=' ')
#별자리
C=A[3]*1000+A[4]*100+A[5]*10+A[6]
별자리=['물병자리','물고기자리','양자리','황소자리','쌍둥이자리','게자리','사자자리','처녀자리','천칭자리','전갈자리','궁수자리','염소자리']
if 120 <= C <=218: print(별자리[0])
if 219 <= C <=320: print(별자리[1])
if 321 <= C <=419: print(별자리[2])
if 420 <= C <=520: print(별자리[3])
if 521 <= C <=621: print(별자리[4])
if 622 <= C <=722: print(별자리[5])
if 723 <= C <=822: print(별자리[6])
if 823 <= C <=923: print(별자리[7])
if 924 <= C <=1022: print(별자리[8])
if 1023 <= C <=1122: print(별자리[9])
if 1123 <= C <=1224: print(별자리[10])
if 1225 <= C or C <=119: print(별자리[11])

#------------------------------------------------------------------------------------------------

#코딩테스트문제5
while True:
    print('---------------------------------------------------')
    print('<영어변환기>')
    print('---------------------------------------------------')
    print('1.입  력 2.대문자 3.소문자')
    print('4.코드화 5.종  료')
    print('---------------------------------------------------')

    a = int(input('메뉴 선택(1~6): '))

    if a == 1:
        print('메뉴선택: ',a)
        text=input('영어입력 :')
        print('영어 입력: ',text)
    elif a == 2:
        print('메뉴선택: ',a)
        print(text.upper())
    elif a == 3:
        print('메뉴선택: ',a)
        print(text.lower())
    elif a == 4:
        print('메뉴선택: ',a)
        for i in text:
            print(hex(ord(i)),end='')
        print()
    elif a == 5:
        print('영어 변환기 프로그램을 종료합니다')
        break